import random
import pandas as pd

# Функция для генерации вымышленных имен и фамилий
def generate_name():
    first_names = ["Иван", "Сергей", "Алексей", "Мария", "Елена", "Дарья"]
    last_names = ["Иванов", "Петров", "Сидоров", "Смирнова", "Кузнецова", "Волкова"]
    return random.choice(first_names) + " " + random.choice(last_names)

# Данные для первой таблицы
data_first_table = {
    "SourceAccount": [1002002, 1003003, 1004004, 1005005, 1006006, 1007007, 1008008, 1009009, 1010010, 1011011, 1012012,
                      1013013, 1014014, 1016016, 1017017, 1018018, 1019019, 1020020, 1021021, 1022022, 1023023, 1024024,
                      1025025, 1026026, 1027027, 1028028, 1029029, 1031031, 1032032, 1033033, 1034034, 1035035, 1035035],
    "DestinationAccount": [2002002, 2204909, 2004004, 2204909, 2006006, 2204909, 2008008, 2204909, 2010010, 2011011, 2012012,
                           2204909, 2014014, 2016016, 2017017, 2204909, 2019019, 2020020, 2021021, 2204909, 2023023, 2024024,
                           2204909, 2026026, 2204909, 2028028, 2029029, 2031031, 2032032, 2033033, 2204909, 2001001, 2035035],
    "TotalTransferred": [7000, 7500, 7000, 7500, 18000, 2500, 15500, 6000, 3500, 2000, 6000, 16000, 13000, 4500, 5000,
                         9500, 3200, 6500, 5000, 32000, 30000, 17000, 4500, 15500, 9500, 3500, 6000, 35000, 5500, 70000,
                         5000, 5000, 4500]
}

# Добавление вымышленных имен и фамилий
first_table = pd.DataFrame(data_first_table)
first_table['OwnerName'] = [generate_name() for _ in range(len(first_table))]

# Данные для второй таблицы
data_second_table = {
    "DestinationAccount": [2001001, 2002002, 2004004, 2006006, 2008008, 2010010, 2011011, 2012012, 2014014, 2016016, 2017017,
                           2019019, 2020020, 2021021, 2023023, 2024024, 2026026, 2028028, 2029029, 2031031, 2032032, 2033033,
                           2035035, 2204909],
    "TotalReceived": [5000, 7000, 7000, 18000, 15500, 3500, 2000, 6000, 13000, 4500, 5000, 3200, 6500, 5000, 30000, 17000,
                      15500, 3500, 6000, 35000, 5500, 70000, 4500, 100000]
}

# Добавление вымышленных имен и фамилий
second_table = pd.DataFrame(data_second_table)
second_table['OwnerName'] = [generate_name() for _ in range(len(second_table))]

print(first_table)
print(second_table)  # Показ первых нескольких записей из обеих таблиц для проверки
